var presentList = [
    {
        "category": "日常",
        "value":[
            {
                "name": "运气",
                "icon": "&#xe8dd;",
                "value": ['大吉','小吉','中吉','凶','大凶']
            },
            {
                "name": "性别",
                "icon": "&#xe84e;",
                "value": ["男","女"]
            },
            {
                "name": "方向",
                "icon": "&#xe52e;",
                "value": ["上","下","左","右"]
            },
            {
                "name": "味道",
                "icon": "&#xe556;",
                "value": ["酸","甜","苦","辣","咸"]
            },
            {
                "name": "大小",
                "icon": "&#xe245;",
                "value": ["最小","较小","中等","较大","最大"]
            }
        ]
    },
    {
        "category": "人设",
        "value":[
            {
                "name": "发型（长度）",
                "icon": "&#xe14e;",
                "value": ["长发","短发"]
            },
            {
                "name": "马尾（高低）",
                "icon": "&#xe14e;",
                "value": ["低马尾","高马尾"]
            },
            {
                "name": "马尾（单双）",
                "icon": "&#xe14e;",
                "value": ["单马尾","双马尾"]
            },
            {
                "name": "罩杯（AA-I）",
                "icon": "&#xe3a6;",
                "value": ["AA","A","B","C","D","E","F","G","H","I"]
            },
            {
                "name": "服饰",
                "icon": "&#xe41d;",
                "value": ["水手服","汉服","西装","卫衣","夹克","羽绒服","吊带裤","运动服","睡衣"]
            },
            {
                "name": "肤色",
                "icon": "&#xe3b7;",
                "value": ["很黑","较黑","偏黄","较白","很白"]
            },
            {
                "name": "性格",
                "icon": "&#xe87d;",
                "value": ["爱管闲事","安静","跋扈","拜金","保守","报复型","暴躁","悲观","博学多才","不合群",
                        "不灵活","不善表达","不善言谈交际","不专注","才思敏捷","猜疑","沉静","沉著","诚实坦白","成熟",
                        "成熟稳重","迟钝","迟缓","冲动","处事洒脱","聪明伶俐","粗心","脆弱","大公无私","胆怯","胆小",
                        "胆小怕事","担忧","淡泊名利","喋喋不休","独立","多愁善感","多疑","乏味","反覆","放任","风趣",
                        "风趣幽默","浮躁","富创造力","富有朝气","富于冒险","刚正不阿","杠精","耿直","工作狂","孤僻",
                        "固执","寡言","果断","果敢坚持","过分敏感","害羞","好表现","好吃懒做","好动","好交际","好批评",
                        "好心肠","好争吵","豪放不羁","豪爽","憨厚","和气","和蔼可亲","患得患失","活泼","活泼可爱",
                        "活力充沛","豁达","积极","积极进取","机敏","尖刻","俭朴","坚强","见多识广","见利忘义","健谈",
                        "健忘","狡猾","谨慎","井井有条","精力充沛","倔强","开朗","开朗大方","可爱","可亲","可依赖",
                        "刻薄","口是心非","快言快语","懒惰","老练","老实","老实巴交","唠叨","乐观","乐善好施","雷历风行",
                        "冷淡","冷漠","礼貌","吝啬","鲁莽","啰嗦","满足","慢条斯理","莽撞","敏感","目中无人","内向","逆反",
                        "脾气暴躁","贫乏","平和","婆婆妈妈","普普通通","勤劳","轻浮","轻率","轻率不踏实","轻松","情绪多变",
                        "缺乏耐力","缺乏自信","热忱","热情","热心助人","任性","认真细心","容忍","柔弱","散漫","善变",
                        "善交际","善解人意","善良","善于分析","善于体察别人","善组织","少言寡语","深沉","神经质","实事求是",
                        "适应能力差","适应能力强","率直","水性扬花","思想开放","随和","踏实","坦率","贪婪","贪小便宜",
                        "体贴","挑衅","挑剔","统治欲","妥协","拖延","外向","完美主义者","顽固","畏缩","温和","温柔体贴",
                        "稳重","无安全感","无目标","无同情心","无畏","武断","务实","务实实际","喜操纵","喜交朋友",
                        "小心谨慎","消极","心胸宽大","心胸狭窄","兴趣广泛","性情平和","羞涩","雄韬伟略","虚荣","虚伪",
                        "循规蹈矩","严肃","言行不一","阳光","一本正经","依赖","毅力","抑郁","易激动","易见异思迁","易怒",
                        "易轻率作决定","易随波逐流","易兴奋","疑神疑鬼","意志坚定","阴险狡诈","勇敢","勇敢正义","友爱","友善",
                        "犹豫不决","忧心忡忡","有趣","有韧性","有条理","优柔寡断","幽默","幼稚","幼稚调皮","愉快",
                        "郁郁寡欢","圆滑老练","怨恨","瞻前顾后","真诚","正义","正直","执拗不灵活","执著","知足","直率",
                        "周到","忠诚","忠心","专横","专横跋扈","追求刺激","自以为是","自信","自私","自负"]
            }
        ]
    },
    {
        "category": "双面选择",
        "value":[
            {
                "name": "做不做",
                "icon": "&#xe065;",
                "value": ["做","不做"]
            },
            {
                "name": "好不好",
                "icon": "&#xe065;",
                "value": ["好","不好"]
            },
            {
                "name": "有没有",
                "icon": "&#xe065;",
                "value": ["有","没有"]
            }
        ]
    },
    {
        "category": "杂类",
        "value":[
            {
                "name": "颜色",
                "icon": "&#xe3b7;",
                "value": ["红","橙","黄","绿","青","蓝","紫","粉","白","黑","灰"]
            },
            {
                "name": "骰子",
                "icon": "&#xe428;",
                "value": ["1","2","3","4","5","6"]
            }
        ]
    }
]