var presentList = [
    {
        "category": "日常",
        "value":[
            {
                "name": "运气",
                "icon": "&#xe8dd;",
                "value": ['大吉','小吉','中吉','凶','大凶']
            },
            {
                "name": "性别",
                "icon": "&#xe84e;",
                "value": ["男","女"]
            },
            {
                "name": "方向",
                "icon": "&#xe52e;",
                "value": ["上","下","左","右"]
            },
            {
                "name": "味道",
                "icon": "&#xe556;",
                "value": ["酸","甜","苦","辣","咸"]
            },
            {
                "name": "大小",
                "icon": "&#xe245;",
                "value": ["最小","较小","中等","较大","最大"]
            }
        ]
    },
    {
        "category": "人设",
        "value":[
            {
                "name": "发型",
                "icon": "&#xe14e;",
                "value": ["长发","短发","寸头","中分","麻花辫","扎马尾","爆炸头","卷发","锅盖","蘑菇头","光头"]
            },
            {
                "name": "服饰",
                "icon": "&#xe41d;",
                "value": ["水手服","汉服","西装","卫衣","夹克","羽绒服","吊带裤","运动服","睡衣","紧身裤","泳衣","比基尼","便装","皮衣","马褂","背心","风衣"]
            },
            {
                "name": "肤色",
                "icon": "&#xe3b7;",
                "value": ["很黑","较黑","偏黄","较白","很白"]
            },
            {
                "name": "性格",
                "icon": "&#xe87d;",
                "value": ["爱管闲事","安静","跋扈","拜金","保守","报复型","暴躁","悲观","博学多才","不合群",
                        "不灵活","不善表达","不善言谈交际","不专注","才思敏捷","猜疑","沉静","沉著","诚实坦白","成熟",
                        "成熟稳重","迟钝","迟缓","冲动","处事洒脱","聪明伶俐","粗心","脆弱","大公无私","胆怯","胆小",
                        "胆小怕事","担忧","淡泊名利","喋喋不休","独立","多愁善感","多疑","乏味","反覆","放任","风趣",
                        "风趣幽默","浮躁","富创造力","富有朝气","富于冒险","刚正不阿","杠精","耿直","工作狂","孤僻",
                        "固执","寡言","果断","果敢坚持","过分敏感","害羞","好表现","好吃懒做","好动","好交际","好批评",
                        "好心肠","好争吵","豪放不羁","豪爽","憨厚","和气","和蔼可亲","患得患失","活泼","活泼可爱",
                        "活力充沛","豁达","积极","积极进取","机敏","尖刻","俭朴","坚强","见多识广","见利忘义","健谈",
                        "健忘","狡猾","谨慎","井井有条","精力充沛","倔强","开朗","开朗大方","可爱","可亲","可依赖",
                        "刻薄","口是心非","快言快语","懒惰","老练","老实","老实巴交","唠叨","乐观","乐善好施","雷历风行",
                        "冷淡","冷漠","礼貌","吝啬","鲁莽","啰嗦","满足","慢条斯理","莽撞","敏感","目中无人","内向","逆反",
                        "脾气暴躁","贫乏","平和","婆婆妈妈","普普通通","勤劳","轻浮","轻率","轻率不踏实","轻松","情绪多变",
                        "缺乏耐力","缺乏自信","热忱","热情","热心助人","任性","认真细心","容忍","柔弱","散漫","善变",
                        "善交际","善解人意","善良","善于分析","善于体察别人","善组织","少言寡语","深沉","神经质","实事求是",
                        "适应能力差","适应能力强","率直","水性扬花","思想开放","随和","踏实","坦率","贪婪","贪小便宜",
                        "体贴","挑衅","挑剔","统治欲","妥协","拖延","外向","完美主义者","顽固","畏缩","温和","温柔体贴",
                        "稳重","无安全感","无目标","无同情心","无畏","武断","务实","务实实际","喜操纵","喜交朋友",
                        "小心谨慎","消极","心胸宽大","心胸狭窄","兴趣广泛","性情平和","羞涩","雄韬伟略","虚荣","虚伪",
                        "循规蹈矩","严肃","言行不一","阳光","一本正经","依赖","毅力","抑郁","易激动","易见异思迁","易怒",
                        "易轻率作决定","易随波逐流","易兴奋","疑神疑鬼","意志坚定","阴险狡诈","勇敢","勇敢正义","友爱","友善",
                        "犹豫不决","忧心忡忡","有趣","有韧性","有条理","优柔寡断","幽默","幼稚","幼稚调皮","愉快",
                        "郁郁寡欢","圆滑老练","怨恨","瞻前顾后","真诚","正义","正直","执拗不灵活","执著","知足","直率",
                        "周到","忠诚","忠心","专横","专横跋扈","追求刺激","自以为是","自信","自私","自负"]
            },
            {
                "name": "辈分",
                "icon": "&#xeb41;",
                "value": ["爷爷","奶奶","爸爸","妈妈","儿子","女儿","孙子","曾孙","祖父","祖母","孙女","阿姨","叔叔","外公","外婆","舅舅","姑姑"]
            },
            {
                "name": "罩杯（A-I）",
                "icon": "&#xe3a6;",
                "value": ["A","B","C","D","E","F","G","H","I"]
            },
            {
                "name": "攻受",
                "icon": "&#xe915;",
                "value": ["攻","受"]
            }
        ]
    },
    {
        "category": "游戏",
        "value":[
            {
                "name": "东方 Project",
                "icon": "&#xe021;",
                "value": ["博丽灵梦","雾雨魔理沙","博丽灵梦","神玉","魅魔","菊理","矜羯罗","幽幻魔眼","依莉斯","萨丽爱尔",
                    "玄爷","里香","明罗","雾雨魔理沙","爱莲","小兔姬","卡娜·安娜贝拉尔","朝仓理香子","北白河千百合",
                    "冈崎梦美","咪咪号","留琴","奥莲姬","胡桃","艾丽","幽香","梦月","幻月","萨拉","露易兹","爱丽丝",
                    "雪","舞","梦子","神绮","露米娅","大妖精","琪露诺","红美铃","小恶魔","帕秋莉·诺蕾姬","十六夜咲夜",
                    "蕾米莉亚·斯卡蕾特","芙兰朵露·斯卡蕾特","冴月麟","蕾蒂·霍瓦特洛克","橙","爱丽丝·玛格特洛依德",
                    "莉莉霍瓦特","露娜萨·普莉兹姆利巴","梅露兰·普莉兹姆利巴","莉莉卡·普莉兹姆利巴","魂魄妖梦","西行寺幽幽子",
                    "八云蓝","八云紫","魂魄妖忌","蕾拉·普莉兹姆利巴","伊吹萃香","莉格露·奈特巴格","米斯蒂娅·萝蕾拉",
                    "上白泽慧音","因幡天为","铃仙·优昙华院·因幡","八意永琳","蓬莱山辉夜","藤原妹红","射命丸文","梅蒂欣·梅兰可莉",
                    "风见幽香","小野塚小町","四季映姬·夜摩仙那度","秋静叶","秋穰子","键山雏","河城荷取","犬走椛","东风谷早苗",
                    "八坂神奈子","洩矢诹访子","永江衣玖","比那名居天子","大鲶鱼","琪斯美","黑谷山女","水桥帕露西","星熊勇仪",
                    "古明地觉","火焰猫燐","灵乌路空","古明地恋","娜兹玲","多多良小伞","云居一轮&云山","村纱水蜜","寅丸星",
                    "圣白莲","封兽鵺","命莲","姬海棠果","幽谷响子","宫古芳香","霍青娥","苏我屠自古","物部布都","丰聪耳神子",
                    "二岩猯藏","秦心","秦河胜","若鹭姬","赤蛮奇","今泉影狼","九十九弁弁","九十九八桥","鬼人正邪","少名针妙丸",
                    "堀川雷鼓","宇佐见堇子","清兰","铃瑚","哆来咪·苏伊特","稀神探女","克劳恩皮丝","纯狐","赫卡提亚·拉碧斯拉祖利",
                    "后羿","依神女苑","依神紫苑","爱塔妮缇拉尔瓦","坂田合欢","高丽野阿吽","矢田寺成美","尔子田里乃","丁礼田舞",
                    "摩多罗隐岐奈","戎璎花","牛崎润美","庭渡久侘歌","吉吊八千慧","杖刀偶磨弓","埴安神袿姬","骊驹早鬼","饕餮尤魔",
                    "豪德寺三花","山城高岭","驹草山如","玉造魅须丸","菅牧典","饭纲丸龙","天弓千亦","姬虫百百世","森近霖之助",
                    "无名的读书妖怪","桑尼米尔克","露娜切露德","斯塔萨菲雅","绵月丰姬","绵月依姬","Reisen","岩笠","月夜见",
                    "石长姬","木花咲耶姬","瑞江浦岛子","嫦娥","稗田阿求","龙神","茨木华扇","假扮魔理沙的妖狐","运松翁","万岁乐",
                    "本居小铃","烟烟罗","卓柏卡布拉","邪龙","沓颊","怨灵少女","年幼的妖狐","蛇妖","易者","抗抑郁药大叔","盐家老板",
                    "宫出口瑞灵","奥野田美宵","鲵吞亭店主","宇佐见莲子","玛艾露贝莉·赫恩","小丑","正直者"]
            },
            {
                "name": "原神",
                "icon": "&#xe021;",
                "value": ["温迪","琴","魈","枫原万叶","流浪者","珐露珊","鹿野院平藏",
                    "砂糖","早柚","钟离","阿贝多","荒泷一斗","凝光","诺艾尔","五郎",
                    "云堇","雷电将军","刻晴","八重神子","赛诺","北斗","菲谢尔","九条裟罗",
                    "丽莎","雷泽","久岐忍","多莉","纳西妲","提纳里","艾尔海森","柯莱","瑶瑶",
                    "达达利亚","珊瑚宫心海","神里绫人","夜兰","莫娜","妮露",
                    "芭芭拉","行秋","坎蒂丝","迪卢克","可莉","胡桃","宵宫","迪希雅","安柏",
                    "班尼特","香菱","辛焱","烟绯","托马","七七","优菈","甘雨","神里绫华","申鹤",
                    "埃洛伊","凯亚","迪奥娜","罗莎莉亚","重云","莱依拉","荧","空"]
            },
            {
                "name": "明日方舟",
                "icon": "&#xe021;",
                "value": ["能天使","W","蓝毒","梅","安德切尔","巡林者","正义骑士号","灰烬",
                    "黑","迷迭香","普罗旺斯","白雪","空爆","早露","假日威龙陈","白金",
                    "流星","克洛丝","空弦","守林人","杰西卡","远牙","陨星","红云",
                    "菲亚梅塔","送葬人","安比尔","鸿雪","灰喉","酸糖","慑砂","松果",
                    "安哲拉","铅踝","四月","奥斯塔","熔泉","寒芒克洛丝","埃拉托",
                    "承曦格雷伊","子月","伊芙利特","夕","阿米娅","夜烟","史都华德","12F",
                    "艾雅法拉","夜魔","远山","炎熔","杜林","莫斯提马","天火","格雷伊",
                    "刻俄柏","惊蛰","卡达","异客","莱恩哈特","深靛","卡涅利安","苦艾","布丁",
                    "橙闪","蜜蜡","黑键","特米米","薄绿","爱丽丝","炎狱炎熔","蚀清","耶拉","洛洛",
                    "星源","至简","雪绒","推进之王","德克萨斯","红豆","香草","夜刀","风笛","凛冬",
                    "清道夫","翎羽","嵯峨","格拉尼","讯使","芬","琴柳","苇草","桃金娘","焰尾","极境",
                    "豆苗","伺夜","贾维","野鬓","夜半","晓歌","陈","耀骑士临光","暴行","缠丸","玫兰莎",
                    "Castle-3","银灰","百炼嘉维尔","芙兰卡","杜宾","月见夜","斯卡蒂","拉普兰德","猎蜂","泡普卡",
                    "赫拉格","因陀罗","艾斯黛尔","煌","幽灵鲨","慕斯","棘刺","诗怀雅","霜叶","史尔特尔","星极","宴",
                    "山","炎客","断罪者","帕拉斯","布洛卡","刻刀","艾丽妮","柏喙","芳汀","玛恩纳","铸铁","杰克","断崖",
                    "可爱的小黑","燧石","石英","鞭刃","战车","赤冬","龙舌兰","海沫","羽毛笔","达格达",
                    "赛雷娅","年","雷蛇","蛇屠箱","卡缇","黑角","闪击","星熊","临光","古米","米格鲁","森蚺","火神","角峰",
                    "斑点","瑕光","可颂","竖雷","泥岩","拜松","泡泡","号角","吽","斥罪","石棉","暴雨","灰毫","暮落","极光",
                    "车尼尔","夜莺","赫默","末药","安赛尔","Lancet-2","","闪灵","白面鸮","调香师","芙蓉","凯尔希","华法琳",
                    "嘉维尔","流明","锡兰","苏苏洛","微风","清流","亚叶","褐果","絮雨","图耶","桑葚","蜜梅","濯尘芙蓉","明椒",
                    "安洁莉娜","浊心斯卡蒂","真理","深海色","梓兰","麦哲伦","令","初雪","地灵","铃兰","梅尔","波登可","灵知","空",
                    "罗比菈塔","白铁","格劳克斯","巫恋","月禾","九色鹿","稀音","夏栎","海蒂","掠风","但书",
                    "阿","归溟幽灵鲨","狮蝎","阿消","THRM-EX","霜华","傀影","缄默德克萨斯","红","砾",
                    "温蒂","食铁兽","暗索","歌蕾蒂娅","崖心","伊桑","水月","槐琥","孑","老鲤","雪雉",
                    "多萝西","卡夫卡","罗宾","乌有","贝娜","绮良","风丸","见行者"]
            },
            {
                "name": "三国杀",
                "icon": "&#xe021;",
                "value": ["刘备","关羽","张飞","诸葛亮","赵云","马超","黄月英","曹操","司马懿","夏侯敦","张辽","许褚","郭嘉","甄姬","孙权","甘宁","吕蒙","黄盖",
                    "周瑜","大乔","陆逊","孙尚香","华佗","吕布","貂蝉",
                    "黄忠","魏延","曹仁","夏侯渊","小乔","周泰","张角","于吉","神吕蒙","神关羽",
                    "庞统","荀彧","典韦","太史慈","袁绍","颜良","庞德","神周瑜","神诸葛亮",
                    "孟获","祝融","曹丕","徐晃","孙坚","鲁肃","董卓","贾诩","神曹操","神吕布",
                    "刘禅","姜维","邓艾","张郃","孙策","张昭＆张紘","蔡文姬","左慈","神赵云","神司马懿",
                    "曹植","于禁","张春华","法正","马谡","徐庶","吴国太","凌统","徐盛","陈宫","高顺",
                    "杨修","貂蝉","公孙瓒","袁术","蜀孙尚香","魏庞德","魏关羽","虎牢关神吕布","魏蔡文姬","群马超","魏贾诩"]
            },
            {
                "name": "赛马娘",
                "icon": "&#xe021;",
                "value": ["特别周","无声铃鹿","东海帝王","丸善斯基","富士奇石","小栗帽","黄金船","伏特加","大和赤骥",
                    "大树快车","草上飞","菱亚马逊","目自麦昆","神鹿","好歌剧","成天自仁","鲁驿象征","气槽","爱丽数码",
                    "玉藻十字","星云天空","美妙姿势","琵琶晨光","曼城茶座","美浦波旁","目白赖恩","姜曙","雪中美人",
                    "米浴","艾尼斯风神","爱丽速子","爱慕织姬","稻荷一","荣进闪耀","真机怜","川上公主",
                    "黄金城","樱花进王","采珠","新光风","东商变革","超级小海湾","醒目飞鹰","荒漠英雄","东瀛佐敦",
                    "中山庆典","成田大进","西野花","春丽","青竹回忆","微光飞驹","美丽周日","待兼福来","名将户仁",
                    "诗歌剧","生野狄杜斯","目白信善","大拓太阳神","双涡轮","目自阿尔单","樱花千代王","天狼星象征",
                    "八重野无敌"]
            }
        ]
    },
    {
        "category": "多面选择",
        "value":[
            {
                "name": "做不做",
                "icon": "&#xe065;",
                "value": ["做","不做"]
            },
            {
                "name": "好不好",
                "icon": "&#xe065;",
                "value": ["好","不好"]
            },
            {
                "name": "有没有",
                "icon": "&#xe065;",
                "value": ["有","没有"]
            },
            {
                "name": "单与双",
                "icon": "&#xe065;",
                "value": ["单","双"]
            },
            {
                "name": "高与低",
                "icon": "&#xe065;",
                "value": ["高","低"]
            },
            {
                "name": "长与短",
                "icon": "&#xe065;",
                "value": ["长","短"]
            },
            {
                "name": "对与错",
                "icon": "&#xe065;",
                "value": ["对","错"]
            },
            {
                "name": "正与负",
                "icon": "&#xe065;",
                "value": ["正","负"]
            },
            {
                "name": "真与假",
                "icon": "&#xe065;",
                "value": ["真","假"]
            },
            {
                "name": "难易度",
                "icon": "&#xe065;",
                "value": ["简单","普通","困难","地狱"]
            },
            {
                "name": "三人称",
                "icon": "&#xe065;",
                "value": ["你","我","它"]
            }
        ]
    },
    {
        "category": "杂类",
        "value":[
            {
                "name": "颜色",
                "icon": "&#xe3b7;",
                "value": ["红","橙","黄","绿","青","蓝","紫","粉","白","黑","灰"]
            },
            {
                "name": "骰子",
                "icon": "&#xe428;",
                "value": ["1","2","3","4","5","6"]
            },
            {
                "name": "水果",
                "icon": "&#xe3e3;",
                "value": ["苹果","梨","葡萄","红提","枣","柑橘","柚","桃","西瓜","杏","甜瓜","香瓜",
                        "荔枝","甘蔗","柿","柠檬","香蕉","芒果","菠萝","哈密瓜","李","石榴","枸杞","山楂",
                        "椰子","桑葚","荸荠","柚子","草莓","沙糖桔","木瓜","橙","圣女果","龙眼","黄瓜",
                        "枇杷","山竹","红毛丹","无花果","布朗","杨桃","人参果","猕猴桃","芭乐","杨梅",
                        "乌梅","蓝莓","西梅","释迦","百花果","黄皮","樱桃","雪莲果","榴莲","火龙果","番石榴",
                        "菠萝蜜","百香果","罗汉果","莲雾","核桃","板栗","开心果","瓜子","榛子","银杏","松子",
                        "白果","坚果","果脯","槟榔果","腰果"
                    ]
            }
        ]
    }
]